CSI API ETABS v1
cStory.SetSplice Method
 Sets the splice height of a defined story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSplice(
	string Name,
	bool SpliceAbove,
	double SpliceHeight
)
Function SetSplice (
	Name As String,
	SpliceAbove As Boolean,
	SpliceHeight As Double
) As Integer
Dim instance As cStory
Dim Name As String
Dim SpliceAbove As Boolean
Dim SpliceHeight As Double
Dim returnValue As Integer
returnValue = instance.SetSplice(Name,
	SpliceAbove, SpliceHeight)
int SetSplice(
	String^ Name,
	bool SpliceAbove,
	double SpliceHeight
)
abstract SetSplice :
        Name : string *
        SpliceAbove : bool *
        SpliceHeight : float -> int
Parameters
Name
Type: System.String
 The name of a defined story
SpliceAbove
Type: System.Boolean
 This is True if the story has a splice height, and False otherwise
SpliceHeight
Type: System.Double
 The story splice height
Return Value
Type: Int32
 Returns zero if the value is successfully set, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim IsMasterStory As Boolean
       Dim SimilarToStory As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set story splice information
       ret = SapModel.Story.SetSplice("Story2", True, 2)
   'get story splice information
       ret = SapModel.Story.GetSplice("Story2", SpliceAbove, SpliceHeight)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace